zelveron/STM32FC/src/main.cpp
/**
 * STM32F407VET6 - BMP581 + BMI323 real-time streamer
 *
 *   BMP581 : I2C1  PB6=SCL, PB7=SDA @0x47  (pressure / temp / altitude)
 *   BMI323 : SPI1  PA5=SCK, PA6=MISO, PA7=MOSI, PA4=CS (accel / gyro)
 *   uBlox  : USART1 PA9=TX, PA10=RX (NMEA), en PE10
 *
 * Output over USB CDC ("SerialUSB"), tagged CSV lines:
 *   BMP,<pressure_hPa>,<temperature_C>,<altitude_m>
 *   BMI,<acc_x>,<acc_y>,<acc_z>,<gyr_x>,<gyr_y>,<gyr_z>   (g, deg/s)
 *   GPS,<lat>,<lon>,<alt_m>,<sats>,<fix>
 *   ATT,<roll_deg>,<pitch_deg>,<yaw_deg>
 *   SD_STATUS,1|<logfile>  (0 = SD init/open failed)
 *   BMI_STATUS,0|1       (0 = not detected, 1 = detected)
 *
 * Sensor data is also logged to the SD card (SDIO, FatFs) as FLTxxxxx.CSV.
 */

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <math.h>
#include <string.h>
#include <stdlib.h>

#include "bmp5.h"
#include "bmp5_defs.h"
#include "bmi323.h"
#include <STM32SD.h>

#define BMP_EN     PB11
#define BMP_EN_ALT PE11
#define BMI_CS     PA4
#define BMI_SCK    PA5
#define BMI_MISO   PA6
#define BMI_MOSI   PA7

static const uint8_t BMP5_ADDR = 0x47;

/* ------------------------------------------------------------------------- */
/* BMP581 (I2C)                                                              */
/* ------------------------------------------------------------------------- */

static int8_t bmp5_i2c_read(uint8_t reg_addr, uint8_t *read_data, uint32_t len, void *intf_ptr)
{
    (void)intf_ptr;
    Wire.beginTransmission(BMP5_ADDR);
    Wire.write(reg_addr);
    if (Wire.endTransmission(false) != 0) return BMP5_E_COM_FAIL;
    if (Wire.requestFrom((uint8_t)BMP5_ADDR, (uint8_t)len) != len) return BMP5_E_COM_FAIL;
    for (uint32_t i = 0; i < len; i++) read_data[i] = Wire.read();
    return BMP5_INTF_RET_SUCCESS;
}

static int8_t bmp5_i2c_write(uint8_t reg_addr, const uint8_t *write_data, uint32_t len, void *intf_ptr)
{
    (void)intf_ptr;
    Wire.beginTransmission(BMP5_ADDR);
    Wire.write(reg_addr);
    for (uint32_t i = 0; i < len; i++) Wire.write(write_data[i]);
    if (Wire.endTransmission() != 0) return BMP5_E_COM_FAIL;
    return BMP5_INTF_RET_SUCCESS;
}

static void bmp5_delay_us(uint32_t period, void *intf_ptr)
{
    (void)intf_ptr;
    delayMicroseconds(period);
}

static struct bmp5_dev bmp_dev;
static struct bmp5_osr_odr_press_config bmp_cfg;

static bool bmp5_begin(void)
{
    memset(&bmp_dev, 0, sizeof(bmp_dev));
    bmp_dev.intf     = BMP5_I2C_INTF;
    bmp_dev.read     = bmp5_i2c_read;
    bmp_dev.write    = bmp5_i2c_write;
    bmp_dev.delay_us = bmp5_delay_us;

    if (bmp5_init(&bmp_dev) != BMP5_OK) return false;

    bmp_cfg.osr_t    = BMP5_OVERSAMPLING_1X;
    bmp_cfg.osr_p    = BMP5_OVERSAMPLING_16X;
    bmp_cfg.press_en = BMP5_ENABLE;
    bmp_cfg.odr      = BMP5_ODR_100_2_HZ;

    if (bmp5_set_osr_odr_press_config(&bmp_cfg, &bmp_dev) != BMP5_OK) return false;
    return true;
}

/* ------------------------------------------------------------------------- */
/* ALS31300 3-axis Hall-effect sensor (software I2C on PB8=SCL, PB9=SDA)      */
/* ------------------------------------------------------------------------- */

#define ALS_SCL   PB8
#define ALS_SDA   PB9
#define ALS_ADDR  0x60   /* ALS31300 default (ADR0=ADR1=GND) = 96 decimal, datasheet Table 19 */

/* PB8/PB9 are I2C1's *alternate* pins and I2C1 is already used by the BMP581
   on PB6/PB7, so the ALS is driven with a small software (bit-bang) I2C master. */

static void als_sda_out(bool high)
{
    pinMode(ALS_SDA, OUTPUT);
    digitalWrite(ALS_SDA, high ? HIGH : LOW);
}

static void als_sda_in(void)
{
    pinMode(ALS_SDA, INPUT_PULLUP);
}

static void als_i2c_start(void)
{
    als_sda_out(true);
    digitalWrite(ALS_SCL, HIGH);
    delayMicroseconds(5);
    als_sda_out(false);            /* SDA falls while SCL high = START */
    delayMicroseconds(5);
    digitalWrite(ALS_SCL, LOW);
}

static void als_i2c_stop(void)
{
    als_sda_out(false);
    digitalWrite(ALS_SCL, HIGH);
    delayMicroseconds(5);
    als_sda_out(true);             /* SDA rises while SCL high = STOP */
    delayMicroseconds(5);
}

/* Write 8 bits MSB-first, then clock the ACK bit. Returns true on ACK. */
static bool als_i2c_write(uint8_t b)
{
    for (int i = 7; i >= 0; i--)
    {
        als_sda_out((b >> i) & 1);
        digitalWrite(ALS_SCL, HIGH);
        delayMicroseconds(5);
        digitalWrite(ALS_SCL, LOW);
        delayMicroseconds(5);
    }
    als_sda_in();                  /* release SDA so the slave can ACK */
    digitalWrite(ALS_SCL, HIGH);
    delayMicroseconds(5);
    bool ack = (digitalRead(ALS_SDA) == LOW);
    digitalWrite(ALS_SCL, LOW);
    delayMicroseconds(5);
    als_sda_out(true);
    return ack;
}

/* Read 8 bits MSB-first; ack=true sends ACK (all but the last byte). */
static uint8_t als_i2c_read(bool ack)
{
    uint8_t b = 0;
    als_sda_in();
    for (int i = 7; i >= 0; i--)
    {
        digitalWrite(ALS_SCL, HIGH);
        delayMicroseconds(5);
        if (digitalRead(ALS_SDA)) b |= (1 << i);
        digitalWrite(ALS_SCL, LOW);
        delayMicroseconds(5);
    }
    als_sda_out(!ack);             /* ACK = SDA low, NACK = SDA high */
    digitalWrite(ALS_SCL, HIGH);
    delayMicroseconds(5);
    digitalWrite(ALS_SCL, LOW);
    delayMicroseconds(5);
    als_sda_out(true);
    return b;
}

static int  als_read_fail_stage = 0;   /* 0=ok, 1=address/reg NACK */

static bool als_read(uint8_t reg, uint8_t *buf, uint8_t len)
{
    als_i2c_start();
    if (!als_i2c_write((ALS_ADDR << 1) | 0)) { als_i2c_stop(); als_read_fail_stage = 1; return false; }
    if (!als_i2c_write(reg))                 { als_i2c_stop(); als_read_fail_stage = 1; return false; }
    als_i2c_start();                         /* repeated START */
    if (!als_i2c_write((ALS_ADDR << 1) | 1)) { als_i2c_stop(); als_read_fail_stage = 1; return false; }
    for (uint8_t i = 0; i < len; i++) buf[i] = als_i2c_read(i < len - 1);
    als_i2c_stop();
    als_read_fail_stage = 0;
    return true;
}

static void als_write(uint8_t reg, const uint8_t *buf, uint8_t len)
{
    als_i2c_start();
    if (!als_i2c_write((ALS_ADDR << 1) | 0)) { als_i2c_stop(); return; }
    if (!als_i2c_write(reg))                 { als_i2c_stop(); return; }
    for (uint8_t i = 0; i < len; i++)
        if (!als_i2c_write(buf[i]))          { als_i2c_stop(); return; }
    als_i2c_stop();
}

/* One-time diagnostic: ACK check + 8-byte data read over software I2C. */
static void als_debug_probe(void)
{
    uint8_t b[8];

    als_i2c_start();
    bool ack = als_i2c_write((ALS_ADDR << 1) | 0);
    als_i2c_stop();

    SerialUSB.print(F("ALS_PRB,"));
    SerialUSB.print(ALS_ADDR, HEX);
    SerialUSB.print(F(",ack="));
    SerialUSB.print(ack ? 1 : 0);
    SerialUSB.print(F(",n="));

    if (ack && als_read(0x28, b, 8))
    {
        SerialUSB.print(8);
        SerialUSB.print(',');
        for (int i = 0; i < 8; i++)
        {
            if (b[i] < 0x10) SerialUSB.print('0');
            SerialUSB.print(b[i], HEX);
        }
    }
    else
    {
        SerialUSB.print(0);
    }
    SerialUSB.println();
}

