zelveron/STM32FC/src/main.cpp
static bool als_present = false;

static void als_begin(void)
{
    pinMode(ALS_SCL, OUTPUT);
    digitalWrite(ALS_SCL, LOW);
    als_sda_out(true);

    /* ACK check at 0x60 over software I2C. */
    als_i2c_start();
    als_present = als_i2c_write((ALS_ADDR << 1) | 0);
    als_i2c_stop();
    if (!als_present) return;

    /* Wake from sleep: register 0x27 bits[1:0] = 0 -> Active Mode.
       Per datasheet, "sleep" is the one register writable WITHOUT entering
       Customer Access mode, so no CAC unlock is needed. */
    uint8_t v[4] = { 0x00, 0x00, 0x00, 0x00 };
    als_write(0x27, v, 4);

    /* Exit-sleep time == power-on delay time. */
    delayMicroseconds(600);
}

static bool als_get(int16_t *x, int16_t *y, int16_t *z, int16_t *t, uint8_t *raw)
{
    uint8_t b[8];
    if (!als_read(0x28, b, 8)) return false;
    if (raw) for (int i = 0; i < 8; i++) raw[i] = b[i];

    int16_t rx = (int16_t)(((uint16_t)b[0] << 4) | (b[5] & 0x0F));
    if (rx & 0x0800) rx |= (int16_t)0xF000;
    int16_t ry = (int16_t)(((uint16_t)b[1] << 4) | ((b[6] >> 4) & 0x0F));
    if (ry & 0x0800) ry |= (int16_t)0xF000;
    int16_t rz = (int16_t)(((uint16_t)b[2] << 4) | (b[6] & 0x0F));
    if (rz & 0x0800) rz |= (int16_t)0xF000;
    int16_t rt = (int16_t)(((uint16_t)(b[3] & 0x3F) << 6) | (b[7] & 0x3F));

    *x = rx; *y = ry; *z = rz; *t = rt;
    return true;
}

/* Scan the I2C bus and report ACKing 7-bit addresses (0x08..0x7F). */
static void i2c_scan(void)
{
    SerialUSB.print(F("I2C_SCAN,"));
    bool first = true;
    for (uint16_t addr = 8; addr <= 0x7F; addr++)
    {
        Wire.beginTransmission((uint8_t)addr);
        if (Wire.endTransmission() == 0)
        {
            if (!first) SerialUSB.print(',');
            SerialUSB.print(addr, HEX);
            first = false;
        }
    }
    SerialUSB.println();
}

/* ------------------------------------------------------------------------- */
/* BMI323 (SPI)                                                              */
/* ------------------------------------------------------------------------- */

/* Bit-bang one byte over SPI, mode 0 (sample MISO on rising SCK). */
static uint8_t bmi_bb_xfer(uint8_t out)
{
    uint8_t in = 0;
    for (int i = 7; i >= 0; i--)
    {
        digitalWrite(BMI_MOSI, (out >> i) & 1);
        digitalWrite(BMI_SCK, HIGH);
        delayMicroseconds(2);
        if (digitalRead(BMI_MISO)) in |= (1 << i);
        digitalWrite(BMI_SCK, LOW);
        delayMicroseconds(2);
    }
    return in;
}

static int8_t bmi3_spi_read(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
    (void)intf_ptr;
    if (length == 0) return BMI3_INTF_RET_SUCCESS;

    digitalWrite(BMI_CS, LOW);
    delayMicroseconds(1);
    bmi_bb_xfer(reg_addr);          /* driver already set the 0x80 read bit */
    for (uint32_t i = 0; i < length; i++) reg_data[i] = bmi_bb_xfer(0x00);
    delayMicroseconds(1);
    digitalWrite(BMI_CS, HIGH);
    return BMI3_INTF_RET_SUCCESS;
}

static int8_t bmi3_spi_write(uint8_t reg_addr, const uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
    (void)intf_ptr;
    if (length == 0) return BMI3_INTF_RET_SUCCESS;

    digitalWrite(BMI_CS, LOW);
    delayMicroseconds(1);
    bmi_bb_xfer(reg_addr);          /* driver already applied the 0x7F write mask */
    for (uint32_t i = 0; i < length; i++) bmi_bb_xfer(reg_data[i]);
    delayMicroseconds(1);
    digitalWrite(BMI_CS, HIGH);
    return BMI3_INTF_RET_SUCCESS;
}

static void bmi3_delay_us(uint32_t period, void *intf_ptr)
{
    (void)intf_ptr;
    delayMicroseconds(period);
}

static struct bmi3_dev bmi_dev;
static bool bmi_ready = false;

/* Raw single-transaction CHIP_ID read (no config upload) for diagnostics. */
static uint8_t bmi_raw_chip_id(void)
{
    uint8_t b[2] = { 0, 0 };
    digitalWrite(BMI_CS, LOW);
    delayMicroseconds(1);
    bmi_bb_xfer(0x80);          /* read register 0x00 */
    b[0] = bmi_bb_xfer(0x00);   /* dummy byte */
    b[1] = bmi_bb_xfer(0x00);   /* chip_id (0x43 for BMI323) */
    delayMicroseconds(1);
    digitalWrite(BMI_CS, HIGH);
    return b[1];
}

static bool bmi323_begin(void)
{
    memset(&bmi_dev, 0, sizeof(bmi_dev));
    bmi_dev.intf           = BMI3_SPI_INTF;
    bmi_dev.read           = bmi3_spi_read;
    bmi_dev.write          = bmi3_spi_write;
    bmi_dev.delay_us       = bmi3_delay_us;
    bmi_dev.read_write_len = 8;

    if (bmi323_init(&bmi_dev) != BMI3_OK) return false;

    struct bmi3_sens_config cfg[2];
    cfg[0].type = BMI323_ACCEL;
    cfg[1].type = BMI323_GYRO;
    if (bmi323_get_sensor_config(cfg, 2, &bmi_dev) != BMI3_OK) return false;

    cfg[0].cfg.acc.odr      = BMI3_ACC_ODR_200HZ;
    cfg[0].cfg.acc.range    = BMI3_ACC_RANGE_4G;
    cfg[0].cfg.acc.bwp      = BMI3_ACC_BW_ODR_QUARTER;
    cfg[0].cfg.acc.avg_num  = BMI3_ACC_AVG4;
    cfg[0].cfg.acc.acc_mode = BMI3_ACC_MODE_NORMAL;

    cfg[1].cfg.gyr.odr      = BMI3_GYR_ODR_200HZ;
    cfg[1].cfg.gyr.range    = BMI3_GYR_RANGE_2000DPS;
    cfg[1].cfg.gyr.bwp      = BMI3_GYR_BW_ODR_HALF;
    cfg[1].cfg.gyr.avg_num  = BMI3_GYR_AVG1;
    cfg[1].cfg.gyr.gyr_mode = BMI3_GYR_MODE_NORMAL;

    if (bmi323_set_sensor_config(cfg, 2, &bmi_dev) != BMI3_OK) return false;

    return true;
}

/* ------------------------------------------------------------------------- */
/* Attitude estimate (complementary filter — ArduPilot DCM/EKF foundation)   */
/* ------------------------------------------------------------------------- */

static float att_roll = 0.0f, att_pitch = 0.0f, att_yaw = 0.0f;
static uint32_t att_last_us = 0;
static bool att_init = false;

static void att_update(float ax, float ay, float az, float gx, float gy, float gz)
{
    uint32_t now = micros();
    float dt = (att_last_us == 0) ? 0.01f : (float)(now - att_last_us) / 1000000.0f;
    if (dt <= 0.0f || dt > 0.1f) dt = 0.01f;
    att_last_us = now;

    /* Roll / pitch from the gravity vector (valid in non-accelerating flight). */
    float acc_roll  = atan2f(ay, az) * RAD_TO_DEG;
    float acc_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * RAD_TO_DEG;

    if (!att_init)
    {
        att_roll  = acc_roll;
        att_pitch = acc_pitch;
        att_yaw   = 0.0f;
        att_init  = true;
        return;
    }

    /* Gyro body rates -> Euler angle rates (rad/s). */
    float p = gx * DEG_TO_RAD;
    float q = gy * DEG_TO_RAD;
    float r = gz * DEG_TO_RAD;

    float sp = sinf(att_roll * DEG_TO_RAD);
    float cp = cosf(att_roll * DEG_TO_RAD);
    float tt = tanf(att_pitch * DEG_TO_RAD);
    float ct = cosf(att_pitch * DEG_TO_RAD);
    if (fabsf(ct) < 0.1f) ct = (ct < 0.0f) ? -0.1f : 0.1f;

