zelveron/STM32FC/src/main.cpp
    float phi_dot   = p + sp * tt * q + cp * tt * r;
    float theta_dot = cp * q - sp * r;
    float psi_dot   = (sp / ct) * q + (cp / ct) * r;

    /* Complementary filter: blend gyro integration (fast, drifts) with the
       accel reference (noisy, no drift). alpha = 0.98 -> ~0.5 s time constant. */
    const float alpha = 0.98f;
    att_roll  = alpha * (att_roll  + phi_dot   * dt * RAD_TO_DEG) + (1.0f - alpha) * acc_roll;
    att_pitch = alpha * (att_pitch + theta_dot * dt * RAD_TO_DEG) + (1.0f - alpha) * acc_pitch;
    att_yaw  += psi_dot * dt * RAD_TO_DEG;
}

/* ------------------------------------------------------------------------- */
/* uBlox GNSS (USART1, NMEA)                                                 */
/* ------------------------------------------------------------------------- */

#define GPS_BAUD 9600

static const uint32_t GPS_BAUDS[] = { 9600, 38400, 115200, 4800, 57600, 19200, 230400, 460800, 921600 };
static uint8_t  gps_baud_idx   = 0;
static uint32_t gps_last_switch = 0;
static uint32_t gps_rx_bytes   = 0;
static bool     gps_locked     = false;
static bool     gps_nmea_valid = false;
static uint8_t  gps_first[160];
static uint16_t gps_first_len  = 0;
static int   gps_sats      = 0;
static int   gps_fix       = 0;
static char  gps_time_str[12] = "";
static float gps_speed_kmh = 0.0f;

/* --- UBX (u-blox binary) helpers for active probing ---------------------- */

static void ubx_send(uint8_t cls, uint8_t id, const uint8_t *payload, uint16_t len)
{
    uint8_t ck_a = 0, ck_b = 0;
    Serial1.write(0xB5);
    Serial1.write(0x62);
    Serial1.write(cls);  ck_a += cls;              ck_b += ck_a;
    Serial1.write(id);   ck_a += id;               ck_b += ck_a;
    Serial1.write(len & 0xFF);        ck_a += (uint8_t)(len & 0xFF);         ck_b += ck_a;
    Serial1.write((len >> 8) & 0xFF); ck_a += (uint8_t)((len >> 8) & 0xFF);  ck_b += ck_a;
    for (uint16_t i = 0; i < len; i++)
    {
        Serial1.write(payload[i]);
        ck_a += payload[i];
        ck_b += ck_a;
    }
    Serial1.write(ck_a);
    Serial1.write(ck_b);
}

/* UBX-MON-VER poll: any u-blox module answers regardless of output config. */
static void ubx_poll_monver(void)
{
    ubx_send(0x0A, 0x04, NULL, 0);
}

/* UBX-CFG-PRT: configure UART1 -> NMEA + UBX out at 9600 8N1. */
static void ubx_enable_nmea(void)
{
    static const uint8_t prt[20] = {
        0x01, 0x00, 0x00, 0x00,       /* portID = UART1, reserved, txReady */
        0xD0, 0x08, 0x00, 0x00,       /* mode: 8N1 */
        0x80, 0x25, 0x00, 0x00,       /* baudRate: 9600 */
        0x03, 0x00,                   /* inProtoMask: UBX | NMEA */
        0x03, 0x00,                   /* outProtoMask: UBX | NMEA */
        0x00, 0x00, 0x00, 0x00        /* flags, reserved */
    };
    ubx_send(0x06, 0x00, prt, sizeof(prt));
}

/* Count signal edges on a pin over a window (microseconds). */
static uint32_t pin_edge_count(int pin, uint32_t window_us)
{
    uint32_t edges = 0;
    int last = digitalRead(pin);
    uint32_t t0 = micros();
    while ((micros() - t0) < window_us)
    {
        int cur = digitalRead(pin);
        if (cur != last)
        {
            edges++;
            last = cur;
        }
    }
    return edges;
}

/* Count edges on two pins concurrently over a window (microseconds). */
static void pin_edge_count2(int p1, int p2, uint32_t window_us,
                            uint32_t *e1, uint32_t *e2)
{
    uint32_t n1 = 0, n2 = 0;
    int l1 = digitalRead(p1), l2 = digitalRead(p2);
    uint32_t t0 = micros();
    while ((micros() - t0) < window_us)
    {
        int c1 = digitalRead(p1);
        if (c1 != l1) { n1++; l1 = c1; }
        int c2 = digitalRead(p2);
        if (c2 != l2) { n2++; l2 = c2; }
    }
    *e1 = n1; *e2 = n2;
}

/* Drain USART1 RX into the boot-burst capture buffer. */
static void gps_drain(void)
{
    while (Serial1.available())
    {
        uint8_t c = (uint8_t)Serial1.read();
        gps_rx_bytes++;
        if (gps_first_len < sizeof(gps_first)) gps_first[gps_first_len++] = c;
    }
}

/* Start USART1 with the correct (crossed) uBlox wiring:
   PA9 = TX (MCU -> uBlox RX), PA10 = RX (uBlox TX -> MCU). */
static void gps_uart_begin(uint32_t baud)
{
    Serial1.end();
    Serial1.setTx(PA9);
    Serial1.setRx(PA10);
    Serial1.begin(baud);
}

static char gps_line[128];
static uint8_t gps_len = 0;
static char gps_last_nmea[96];

/* Split a comma-separated NMEA field list, preserving empty fields. */
static int gps_split(char *s, char *f[], int max)
{
    int n = 0;
    f[n++] = s;
    for (char *p = s; *p && n < max; p++)
    {
        if (*p == ',')
        {
            *p = '\0';
            f[n++] = p + 1;
        }
    }
    return n;
}

/* Validate the trailing *XX checksum of any NMEA sentence. */
static bool gps_valid_nmea(const char *line)
{
    int len = (int)strlen(line);
    if (line[0] != '$' || len < 8 || line[len - 3] != '*') return false;
    uint8_t cs = 0;
    for (int i = 1; i < len - 3; i++) cs ^= (uint8_t)line[i];
    uint8_t cs_hex = (uint8_t)strtol(line + len - 2, NULL, 16);
    return cs == cs_hex;
}

/* Convert NMEA time "HHMMSS.ss" into "HH:MM:SS". */
static void gps_store_time(const char *nmea_time)
{
    if (nmea_time[0] == '\0' || strlen(nmea_time) < 6) return;
    gps_time_str[0] = nmea_time[0];
    gps_time_str[1] = nmea_time[1];
    gps_time_str[2] = ':';
    gps_time_str[3] = nmea_time[2];
    gps_time_str[4] = nmea_time[3];
    gps_time_str[5] = ':';
    gps_time_str[6] = nmea_time[4];
    gps_time_str[7] = nmea_time[5];
    gps_time_str[8] = '\0';
}

/* Parse $GxRMC: UTC time + speed over ground (knots -> km/h). */
static bool gps_process_rmc(char *line)
{
    int len = (int)strlen(line);
    if (line[0] != '$' || line[3] != 'R' || line[4] != 'M' || line[5] != 'C')
        return false;
    if (len < 10 || line[len - 3] != '*') return false;
    uint8_t cs = 0;
    for (int i = 1; i < len - 3; i++) cs ^= (uint8_t)line[i];
    uint8_t cs_hex = (uint8_t)strtol(line + len - 2, NULL, 16);
    if (cs != cs_hex) return false;

    line[len - 3] = '\0';
    char *f[13];
    int n = gps_split(line, f, 13);
    if (n < 8) return false;

    gps_store_time(f[1]);
    if (f[7][0] != '\0') gps_speed_kmh = atof(f[7]) * 1.852f;  /* knots -> km/h */
    return true;
}

static bool gps_process_line(char *line)
{
    int len = (int)strlen(line);

    /* Match NMEA GGA sentences ($GPGGA / $GNGGA / $GLGGA / ...). */
    if (line[0] != '$' || line[3] != 'G' || line[4] != 'G' || line[5] != 'A')
        return false;

    /* Validate the trailing *XX checksum. */
    if (len < 10 || line[len - 3] != '*') return false;
    uint8_t cs = 0;
    for (int i = 1; i < len - 3; i++) cs ^= (uint8_t)line[i];
    uint8_t cs_hex = (uint8_t)strtol(line + len - 2, NULL, 16);
    if (cs != cs_hex) return false;

    line[len - 3] = '\0';            /* drop checksum before splitting */

