zelveron/STM32FC/src/main.cpp
    char *f[15];
    int n = gps_split(line, f, 15);

    /* Need fields through altitude unit (index 10). */
    if (n < 11) return false;

    int sats = atoi(f[7]);
    int fix  = atoi(f[6]);
    gps_sats = sats;
    gps_fix  = fix;
    gps_store_time(f[1]);

    /* Report fix quality + satellite count once per second, even with no
       position (lets us watch satellite acquisition). */
    static uint32_t last_gps_stat = 0;
    if ((millis() - last_gps_stat) >= 1000)
    {
        last_gps_stat = millis();
        SerialUSB.print(F("GPS_STAT,"));
        SerialUSB.print(fix);
        SerialUSB.print(',');
        SerialUSB.print(sats);
        SerialUSB.print(',');
        SerialUSB.print(gps_time_str);
        SerialUSB.print(',');
        SerialUSB.println(gps_speed_kmh, 1);
    }

    if (f[2][0] == '\0' || f[4][0] == '\0') return false;

    float lat_raw = atof(f[2]);
    float lat = (int)(lat_raw / 100.0f) + (lat_raw - (int)(lat_raw / 100.0f) * 100.0f) / 60.0f;
    if (f[3][0] == 'S') lat = -lat;

    float lon_raw = atof(f[4]);
    float lon = (int)(lon_raw / 100.0f) + (lon_raw - (int)(lon_raw / 100.0f) * 100.0f) / 60.0f;
    if (f[5][0] == 'W') lon = -lon;

    float gps_alt = atof(f[9]);

    SerialUSB.print(F("GPS,"));
    SerialUSB.print(lat, 6);
    SerialUSB.print(',');
    SerialUSB.print(lon, 6);
    SerialUSB.print(',');
    SerialUSB.print(gps_alt, 1);
    SerialUSB.print(',');
    SerialUSB.print(sats);
    SerialUSB.print(',');
    SerialUSB.print(fix);
    SerialUSB.print(',');
    SerialUSB.print(gps_time_str);
    SerialUSB.print(',');
    SerialUSB.println(gps_speed_kmh, 1);
    return true;
}

/* ------------------------------------------------------------------------- */
/* Data logging (SD card over SDIO, FatFs)                                   */
/* ------------------------------------------------------------------------- */

static float g_ax = 0, g_ay = 0, g_az = 0, g_gx = 0, g_gy = 0, g_gz = 0;
static float g_press = 0, g_temp = 0, g_alt = 0;

static File sd_file;
static bool sd_ok = false;
static char sd_log_name[16];

/* ------------------------------------------------------------------------- */
/* setup / loop                                                              */
/* ------------------------------------------------------------------------- */

void setup(void)
{
    pinMode(BMP_EN_ALT, OUTPUT); digitalWrite(BMP_EN_ALT, HIGH);
    pinMode(BMP_EN, OUTPUT);     digitalWrite(BMP_EN, HIGH);

    /* PC14: ALS enable (OSC32 pin - drive via registers) */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    GPIOC->MODER = (GPIOC->MODER & ~(3UL << 28)) | (1UL << 28);
    GPIOC->BSRR = (1UL << 14);

    pinMode(BMI_CS, OUTPUT);   digitalWrite(BMI_CS, HIGH);
    pinMode(BMI_SCK, OUTPUT);  digitalWrite(BMI_SCK, LOW);
    pinMode(BMI_MOSI, OUTPUT); digitalWrite(BMI_MOSI, LOW);
    pinMode(BMI_MISO, INPUT_PULLUP);

    Wire.setSCL(PB6);
    Wire.setSDA(PB7);
    Wire.begin();

    als_begin();

    SerialUSB.begin();
    gps_uart_begin(GPS_BAUD);

    /* Wait (bounded) for the USB host, draining uBlox boot burst meanwhile. */
    for (int i = 0; i < 300 && !SerialUSB; i++) { gps_drain(); delay(10); }
    delay(100);
    gps_drain();
    SerialUSB.println(F("boot: BMP581 + BMI323 + uBlox + SD streamer"));

    /* One-time I2C bus scan + ALS presence report. */
    i2c_scan();
    SerialUSB.print(F("ALS_STATUS,"));
    SerialUSB.println(als_present ? 1 : 0);
    als_debug_probe();
    gps_drain();

    /* --- SD card (SDIO 4-bit) + log file -------------------------------- */
    sd_ok = SD.begin();
    if (sd_ok)
    {
        int n = 0;
        do { snprintf(sd_log_name, sizeof(sd_log_name), "FLT%05d.CSV", n++); }
        while (SD.exists(sd_log_name));

        sd_file = SD.open(sd_log_name, FILE_WRITE);
        if (sd_file)
        {
            sd_file.println(F("t_ms,ax,ay,az,gx,gy,gz,roll,pitch,yaw,press_hPa,temp_c,alt_m,gps_time,gps_sats,gps_speed_kmh"));
            sd_file.flush();
            SerialUSB.print(F("SD_STATUS,1,"));
            SerialUSB.println(sd_log_name);
        }
        else
        {
            sd_ok = false;
            SerialUSB.println(F("SD_STATUS,0,open_failed"));
        }
    }
    else
    {
        SerialUSB.println(F("SD_STATUS,0,begin_failed"));
    }
}

void loop(void)
{
    /* --- uBlox GNSS: read NMEA over USART1 ------------------------------- */
    while (Serial1.available())
    {
        char c = (char)Serial1.read();
        gps_rx_bytes++;
        if (gps_first_len < sizeof(gps_first)) gps_first[gps_first_len++] = (uint8_t)c;
        if (c == '\n')
        {
            gps_line[gps_len] = '\0';
            if (gps_valid_nmea(gps_line))
            {
                gps_nmea_valid = true;
                strncpy(gps_last_nmea, gps_line, sizeof(gps_last_nmea) - 1);
                gps_last_nmea[sizeof(gps_last_nmea) - 1] = '\0';
            }
            if (gps_process_line(gps_line)) gps_locked = true;
            gps_process_rmc(gps_line);
            gps_len = 0;
        }
        else if (c != '\r' && gps_len < (sizeof(gps_line) - 1))
        {
            gps_line[gps_len++] = c;
        }
    }

    /* Baud auto-detect: cycle until we see a valid NMEA sentence. */
    if (!gps_nmea_valid && (millis() - gps_last_switch) >= 2000)
    {
        gps_last_switch = millis();
        gps_baud_idx = (uint8_t)((gps_baud_idx + 1) % (sizeof(GPS_BAUDS) / sizeof(GPS_BAUDS[0])));
        gps_uart_begin(GPS_BAUDS[gps_baud_idx]);
    }

    /* Active u-blox probe: poll version + enable NMEA every ~2 s. */
    static uint32_t last_ubx = 0;
    if ((millis() - last_ubx) >= 2000)
    {
        last_ubx = millis();
        ubx_poll_monver();
        ubx_enable_nmea();
    }

    /* Wiring diagnostic: listen on PA9 (swap test) + PA10 (RX-present test)
       every ~4 s. Edges > ~5 mean data traffic on that pin. */
    static uint32_t last_pa = 0;
    if ((millis() - last_pa) >= 4000)
    {
        last_pa = millis();
        uint32_t cur_baud = GPS_BAUDS[gps_baud_idx];
        Serial1.end();
        pinMode(PA9, INPUT_PULLUP);
        uint32_t e9 = pin_edge_count(PA9, 50000);    /* 50 ms window */
        int l9 = digitalRead(PA9);
        pinMode(PA10, INPUT_PULLUP);
        uint32_t e10 = pin_edge_count(PA10, 50000);  /* 50 ms window */
        int l10 = digitalRead(PA10);
        gps_uart_begin(cur_baud);
        SerialUSB.print(F("PA_EDGES,"));
        SerialUSB.print(e9);
        SerialUSB.print(',');
        SerialUSB.print(l9);
        SerialUSB.print(',');
        SerialUSB.print(e10);
        SerialUSB.print(',');
        SerialUSB.println(l10);
    }

    /* Debug: report rx byte count / baud / lock state every 2 s. */
    static uint32_t last_gps_dbg = 0;
    if ((millis() - last_gps_dbg) >= 2000)
    {
        last_gps_dbg = millis();
        SerialUSB.print(F("GPS_DBG,"));
        SerialUSB.print(gps_rx_bytes);
        SerialUSB.print(',');
        SerialUSB.print(GPS_BAUDS[gps_baud_idx]);
        SerialUSB.print(',');
        SerialUSB.println(gps_locked ? 1 : 0);
    }

    /* Show captured uBlox boot bytes (hex) every 3 s. */
    static uint32_t last_gps_first = 0;
    if ((millis() - last_gps_first) >= 3000)
    {
        last_gps_first = millis();
        SerialUSB.print(F("GPS_FIRST,"));
        SerialUSB.print(gps_first_len);
        SerialUSB.print(',');
        for (uint16_t i = 0; i < gps_first_len && i < 64; i++)
        {
            if (gps_first[i] < 0x10) SerialUSB.print('0');
            SerialUSB.print(gps_first[i], HEX);
        }
        SerialUSB.println();
    }

    /* Echo the most recent valid NMEA sentence (1 Hz). */
    static uint32_t last_nmea = 0;
    if (gps_nmea_valid && (millis() - last_nmea) >= 1000)
    {
        last_nmea = millis();
        SerialUSB.print(F("GPS_RAW,"));
        SerialUSB.println(gps_last_nmea);
    }

    /* --- BMI323 presence detection (retry every 1 s until found) --------- */
    static uint32_t last_bmi_retry = 0;
    if (!bmi_ready && (millis() - last_bmi_retry) >= 1000)
    {
        last_bmi_retry = millis();
        if (bmi323_begin())
        {
            bmi_ready = true;
            SerialUSB.println(F("BMI_STATUS,1"));
        }
        else
        {
            SerialUSB.println(F("BMI_STATUS,0"));
            uint8_t raw = bmi_raw_chip_id();
            SerialUSB.print(F("BMI_RAW,0x"));
            SerialUSB.println(raw, HEX);
        }
    }

    /* --- BMI323 streaming at ~100 Hz ------------------------------------- */
    static uint32_t last_bmi = 0;
    if (bmi_ready && (millis() - last_bmi) >= 10)
    {
        last_bmi = millis();

        struct bmi3_sensor_data data[2];
        data[0].type = BMI323_ACCEL;
        data[1].type = BMI323_GYRO;
        if (bmi323_get_sensor_data(data, 2, &bmi_dev) == BMI3_OK)
        {
            float ax = (float)data[0].sens_data.acc.x * 4.0f / 32768.0f;
            float ay = (float)data[0].sens_data.acc.y * 4.0f / 32768.0f;
            float az = (float)data[0].sens_data.acc.z * 4.0f / 32768.0f;
            float gx = (float)data[1].sens_data.gyr.x * 2000.0f / 32768.0f;
            float gy = (float)data[1].sens_data.gyr.y * 2000.0f / 32768.0f;
            float gz = (float)data[1].sens_data.gyr.z * 2000.0f / 32768.0f;

            att_update(ax, ay, az, gx, gy, gz);
            g_ax = ax; g_ay = ay; g_az = az;
            g_gx = gx; g_gy = gy; g_gz = gz;

            SerialUSB.print(F("BMI,"));
            SerialUSB.print(ax, 4);
            SerialUSB.print(',');
            SerialUSB.print(ay, 4);
            SerialUSB.print(',');
            SerialUSB.print(az, 4);
            SerialUSB.print(',');
            SerialUSB.print(gx, 2);
            SerialUSB.print(',');
            SerialUSB.print(gy, 2);
            SerialUSB.print(',');
            SerialUSB.println(gz, 2);
        }
        else
        {
            /* Read failed - drop out of ready so we re-initialize. */
            bmi_ready = false;
            SerialUSB.println(F("BMI_STATUS,0"));
        }
    }

